#+TITLE: Apache Doris 代码架构分析
#+AUTHOR: Generated by Claude Code
#+DATE: 2026-06-23
#+OPTIONS: toc:3 num:t

* 项目概述

Apache Doris 是一个基于 *MPP（大规模并行处理）架构* 的高性能实时分析数据库。采用 *前端（FE）+ 后端（BE）* 分离架构：

- *FE (Frontend)*：Java 实现，负责 SQL 解析、查询优化、元数据管理、事务协调
- *BE (Backend)*：C++ 实现，负责数据存储、查询执行、数据导入
- *Cloud*：C++ 实现，云原生存算分离的元数据服务（Meta Service）
- *代码规模*：~2900 个 C++ 文件 + ~6800 个 Java 文件

#+BEGIN_SRC plantuml :file doris-overall-arch.png :exports results
@startuml
skinparam componentStyle rectangle
skinparam backgroundColor #FEFEFE
skinparam defaultFontSize 12

package "FE (Frontend) - Java" as FE #LightBlue {
  [SQL 解析\n(Nereids)] as Parser
  [查询优化\n(Cascades)] as Optimizer
  [协调执行\n(Coordinator)] as Coord
  [元数据管理\n(Env/Catalog)] as Meta
  Parser -right-> Optimizer
  Optimizer -right-> Coord
  Coord -right-> Meta
}

package "BE (Backend) - C++" as BE #LightGreen {
  [服务层\n(BRPC/HTTP/Thrift)] as Svc
  [执行引擎\n(Pipeline)] as Exec
  [存储引擎\n(Tablet/Rowset)] as Storage
  [IO层\n(S3/HDFS/Local)] as IO
  Svc -right-> Exec
  Exec -right-> Storage
  Storage -right-> IO
}

actor Client as C
C -down-> FE : MySQL Protocol
FE -down-> BE : Thrift RPC
@enduml
#+END_SRC

#+RESULTS:
: ,---------.  ,----------.   ,-------------.   ,-------------.   ,------------------.   ,----------.   ,---------------.   ,---------------.          
: |SQL 解析 |  |查询优化  |   |协调执行     |   |元数据管理   |   |服务层            |   |执行引擎  |   |存储引擎       |   |IO层           |  ,------.
: |---------|  |----------|   |-------------|   |-------------|   |------------------|   |----------|   |---------------|   |---------------|  |Client|
: |         |--|          |---|             |---|             |   |                  |---|          |---|               |-- |               |  |------|
: `---------'  `----------'   `-------------'   `-------------'   `------------------'   `----------'   `---------------'   `---------------'  `------'

* 项目顶层目录结构

#+BEGIN_SRC text
doris/
├── fe/                    # Frontend (Java) - SQL解析/优化/协调
├── be/                    # Backend (C++) - 存储/执行引擎
├── cloud/                 # 云原生元数据服务 (C++)
├── common/                # BE+Cloud 共享 C++ 基础库
├── gensrc/                # 代码生成 (Proto/Thrift IDL定义)
├── thirdparty/            # 第三方依赖管理
├── fs_brokers/            # 文件系统 Broker (HDFS/CDC)
├── fe_plugins/            # FE 插件 (审计/SQL转换)
├── extension/             # 生态集成 (DataX/dbt/Logstash/Beats)
├── sdk/                   # 客户端 SDK (Java/Go)
├── ui/                    # Web 管理界面 (React+TypeScript)
├── webroot/               # BE HTTP 静态资源
├── conf/                  # 配置文件 (fe.conf/be.conf)
├── docker/                # Docker 编译/运行镜像
├── regression-test/       # 回归测试框架 (Groovy)
├── pytest/                # Python 测试
├── tools/                 # 运维/基准测试工具
├── samples/               # 示例数据
├── docs/                  # 文档 (仅 README，实际文档在官网)
├── build.sh               # 主构建脚本
├── env.sh                 # 环境设置脚本
└── run-*-ut.sh            # 单元测试脚本
#+END_SRC

* FE（Frontend）架构

** Maven 多模块结构

#+BEGIN_SRC text
fe/
├── pom.xml                    # 父 POM
├── fe-core/                   # 核心实现 (~90% 代码)
├── fe-foundation/             # 基础抽象和核心接口
├── fe-common/                 # 共享工具类
├── fe-catalog/                # Catalog 接口和 SPI
├── fe-filesystem/             # 文件系统抽象
├── fe-extension-spi/          # 扩展插件 SPI
├── fe-connector/              # 外部连接器接口
├── fe-extension-loader/       # 扩展插件加载机制
├── fe-sql-parser/             # SQL 解析器（legacy + Nereids）
├── fe-authentication/         # 认证框架
├── fe-thrift/                 # Thrift 服务定义
├── fe-type/                   # 类型系统
├── fe-grpc/                   # gRPC 服务定义
├── hive-udf/                  # Hive UDF 支持
└── be-java-extensions/        # BE 端 Java 扩展
#+END_SRC

** fe-core 核心包结构

#+BEGIN_SRC text
org.apache.doris/
├── DorisFE.java               # 主入口：启动所有服务
├── catalog/                   # 全局元数据管理
│   ├── Env.java               #   全局单例：数据库/表/分区/用户/角色
│   ├── Database.java          #   数据库抽象
│   ├── Table.java             #   表基类 (OlapTable/MysqlTable/HiveTable...)
│   ├── Partition.java         #   分区元数据
│   └── authorizer/            #   权限控制
│
├── nereids/                   # ★ 新一代查询优化器 (Cascades框架)
│   ├── NereidsPlanner.java    #   优化器入口
│   ├── CascadesContext.java   #   Cascades 搜索上下文
│   ├── memo/                  #   Memo 数据结构 (Group/GroupExpression)
│   ├── rules/                 #   优化规则
│   │   ├── analysis/          #     语义分析规则
│   │   ├── exploration/       #     探索规则 (Join重排等)
│   │   ├── implementation/    #     实现规则 (逻辑→物理)
│   │   ├── rewrite/           #     重写规则
│   │   └── expression/        #     表达式优化规则
│   ├── trees/plans/           #   计划树
│   │   ├── logical/           #     逻辑计划节点
│   │   └── physical/          #     物理计划节点
│   ├── cost/                  #   代价模型
│   ├── stats/                 #   统计信息
│   ├── properties/            #   物理属性 (分布/排序)
│   ├── jobs/                  #   优化任务调度
│   │   ├── cascades/          #     Cascades 优化任务
│   │   ├── rewrite/           #     重写任务
│   │   └── joinorder/         #     Join 顺序优化
│   └── glue/translator/       #   计划翻译 (Nereids→BE Plan)
│
├── analysis/                  # SQL 语义分析 (Legacy)
│   ├── Analyzer.java          #   语义分析器
│   └── *.java                 #   各种 AST 节点
│
├── planner/                   # 查询计划生成 (Legacy)
│   ├── SingleNodePlanner.java #   单节点计划
│   ├── DistributedPlanner.java#   分布式计划
│   └── *Node.java             #   计划节点
│
├── qe/                        # 查询执行 & 会话管理
│   ├── ConnectProcessor.java  #   MySQL 协议处理
│   ├── Coordinator.java       #   分布式查询协调器
│   ├── ConnectContext.java    #   会话上下文
│   └── ConnectScheduler.java  #   连接调度
│
├── service/                   # 服务器实现
│   ├── FrontendServiceImpl.java # Thrift RPC 实现 (BE↔FE)
│   └── ExecuteEnv.java        #   执行环境
│
├── master/                    # Master 节点操作
│   ├── MasterImpl.java        #   Leader 专属 RPC
│   ├── ReportHandler.java     #   BE 上报处理
│   └── Checkpoint.java        #   元数据 Checkpoint
│
├── transaction/               # 分布式事务管理
│   ├── GlobalTransactionMgr.java  # 全局事务管理器
│   ├── DatabaseTransactionMgr.java# 数据库级事务管理器
│   ├── Transaction.java       #   事务状态机
│   └── PublishVersionDaemon.java  # 版本发布守护线程
│
├── load/                      # 数据导入
│   ├── StreamLoadHandler.java #   HTTP Stream Load
│   ├── loadv2/                #   Broker Load V2
│   └── routineload/           #   Routine Load (Kafka)
│
├── alter/                     # Schema 变更
│   ├── SchemaChangeHandler.java   # 列增删改
│   └── MaterializedViewHandler.java # 物化视图
│
├── datasource/                # ★ 多 Catalog 外部数据源
│   ├── CatalogMgr.java        #   Catalog 管理器
│   ├── hive/                  #   Hive 数据源
│   ├── iceberg/               #   Iceberg 数据源
│   ├── hudi/                  #   Hudi 数据源
│   ├── paimon/                #   Paimon 数据源
│   ├── jdbc/                  #   JDBC 外部数据源
│   ├── es/                    #   Elasticsearch 数据源
│   ├── maxcompute/            #   MaxCompute 数据源
│   └── trinoconnector/        #   Trino Connector
│
├── task/                      # Agent 任务下发 (FE→BE)
│   └── *Task.java             #   CreateReplicaTask/CloneTask/PushTask...
│
├── journal/                   # 元数据 Journal (HA)
│   └── bdbje/                 #   BerkeleyDB JE 实现
│
├── persist/                   # 操作日志持久化
│   └── *Info.java             #   每种 DDL 操作的序列化类
│
├── clone/                     # Tablet 副本修复/均衡
│   ├── TabletScheduler.java   #   调度器
│   └── *Rebalancer.java       #   均衡策略
│
├── ha/                        # 高可用
├── backup/                    # 备份恢复
├── httpv2/                    # HTTP Server (Spring Boot)
├── mysql/                     # MySQL 协议实现
├── plugin/                    # 插件框架
├── resource/                  # 资源管理 (Workload Group)
├── statistics/                # 统计信息收集
├── policy/                    # 行级安全/存储策略
└── common/                    # 配置/工具类
    └── Config.java            #   FE 配置参数
#+END_SRC

** FE 核心数据流

#+BEGIN_SRC plantuml :file fe-query-flow.png :exports results
@startuml
skinparam backgroundColor #FEFEFE
skinparam defaultFontSize 11

title FE 查询处理流程

(*) --> "Client\n(MySQL Protocol)"

--> "ConnectProcessor\n(MySQL 协议处理)"

--> "Nereids Analyzer\n(SQL 语义分析, 默认)" as Nereids
--> "NereidsPlanner\n(Cascades 优化, 默认)" as Cascades

note right
  - Memo 搜索空间
  - Rewrite -> Exploration
    -> Implementation
  - Cost-based 枚举
end note

--> "Translator\n(Nereids Plan → BE PlanFragment)"

--> "Coordinator\n(分布式执行协调)"

note right
  - 下发 PlanFragment 到各 BE
  - 收集各 BE 执行结果
  - 返回最终结果给客户端
end note

--> (*)

@enduml
#+END_SRC

#+RESULTS:
#+begin_example
             ,-----.                                     
             |start|                                     
             |-----|                                     
             `-----'                                     
                 |                                       
                 |                                       
        ,----------------.                               
        |Client          |                               
        |----------------|                               
        |                |                               
        `----------------'                               
                 |                                       
        ,----------------.                               
        |ConnectProcessor|                               
        |----------------|                               
        |                |                               
        `----------------'                               
                 |                                       
                                                         
      ,--------------------.                             
      |Nereids Analyzer    |                             
      |--------------------|                             
      |                    |                             
      `--------------------'                             
                 |                                       
                 |             ,------------------------.
     ,---------------------.   |- Memo 搜索空间         |
     |NereidsPlanner       |   |------------------------|
     |---------------------|---|  -> Implementation     |
     |                     |   |- Cost-based 枚举       |
     `---------------------'   |                        |
                 |             `------------------------'
                 |                                       
,--------------------------------.                       
|Translator                      |                       
|--------------------------------|                       
|                                |                       
`--------------------------------'                       
                 |                                       
                 |                                       
        ,----------------.  ,---------------------------.
        |Coordinator     |  |- 下发 PlanFragment 到各 BE|
        |----------------|  |---------------------------|
        |                |--|- 返回最终结果给客户端     |
        `----------------'  |                           |
                 |          `---------------------------'
                 |                                       
              ,---.                                      
              |end|                                      
              |---|                                      
              `---'                                      
#+end_example

* BE（Backend）架构

** 构建产物

BE 编译产出 =doris_be= 可执行文件，由 *17 个静态库* 链接而成：

#+BEGIN_SRC text
doris_be
  ├── Agent        # 心跳/任务处理
  ├── Common       # 配置/日志/状态/信号
  ├── Core         # 向量化引擎核心类型
  ├── Exec         # 查询执行引擎 (Pipeline)
  ├── Exprs        # 表达式/函数求值
  ├── Format       # 文件格式读写 (Parquet/ORC/CSV/JSON)
  ├── IO           # I/O 抽象层 (S3/HDFS/Local)
  ├── Storage      # 本地存储引擎
  ├── Runtime      # 运行时环境 (内存/缓存/Workload)
  ├── Service      # 服务层 (BRPC/HTTP/Thrift/Arrow Flight)
  ├── Udf          # 用户自定义函数
  ├── Util         # 工具库 (压缩/编码/哈希/网络)
  ├── Load         # 数据导入管线
  ├── GenCpp       # Proto/Thrift 生成代码
  ├── InfoSchema   # Information Schema 扫描
  ├── Cloud        # 云原生存储引擎
  └── CommonCPP    # 共享 C++ 基础 (common/cpp)
#+END_SRC

** be/src/ 模块详解

*** service/ -- 服务层 - 主入口

=doris_main.cpp= (730行) 启动流程：
1. 信号处理 → 配置加载 → 磁盘检查
2. ExecEnv 初始化
3. 启动 6 个服务:
   - Thrift Server (=be_port=)
   - BRPC Server (=brpc_port=)
   - HTTP Server (=webserver_port=)
   - Heartbeat Server
   - Arrow Flight SQL Server
   - Daemon 后台线程

*** runtime/ -- 运行时环境

- =exec_env.h/.cpp= -- 全局环境单例
- =fragment_mgr.h/.cpp= -- Fragment 管理器
- =runtime_state.h/.cpp= -- 查询运行时状态
- =memory/= -- 内存管理 (=MemTracker= / =MemTrackerLimiter=)
- =workload_group/= -- CPU/内存隔离组
- =workload_management/= -- 工作负载策略
- =query_cache/= -- 查询结果缓存

*** exec/ -- 查询执行引擎 (Pipeline)

- =pipeline/= -- Pipeline 执行框架
  - =pipeline.h/.cpp= -- Pipeline 抽象
  - =pipeline_task.h= -- PipelineTask 调度单元
  - =task_scheduler.h= -- 任务调度器
  - =task_queue.h= -- 多级反馈队列
  - =pipeline_fragment_context.h= -- Fragment 上下文

- =operator/= -- Pipeline 算子 (~70+)
  - =scan/= -- 扫描算子
  - =join/= -- Join 算子: Inner / LeftOuter / FullOuter / Semi / Anti / NullAware / Asof
  - =aggregation_*= -- 聚合算子
  - =analytic_*= -- 窗口函数算子
  - =sort_*= -- 排序算子
  - =exchange_*= -- 数据交换算子
  - =union_*= -- Set 操作算子
  - =repeat_*= -- ROLLUP/CUBE 算子

- =scan/= -- 扫描器 (=olap_scanner= / =file_scanner= / =jdbc_scanner=)
- =sink/= -- 数据 Sink (Tablet 路由 / Block 转换 / Delta Writer)
- =exchange/= -- 数据 Shuffle
- =sort/= -- 排序实现
- =spill/= -- 算子溢写磁盘
- =runtime_filter/= -- Runtime Filter

*** storage/ -- 本地存储引擎

- =tablet/= -- Tablet 管理 (=Tablet= / =TabletMeta= / =TabletManager=)
- =rowset/= -- Rowset 读写 (=RowsetWriter= / =RowsetReader=)
- =segment/= -- Segment 列存格式 (=ColumnReader= / =ColumnWriter=)
- =compaction/= -- Compaction (Cumulative / Base)
- =schema_change/= -- Schema 变更
- =index/= -- 索引 (ANN向量 / 倒排 / Bloom Filter)
- =delete/= -- 删除谓词
- =snapshot/= -- 快照管理
- =txn/= -- 事务管理

*** core/ -- 向量化引擎核心

- =block/= -- Block (列集合 + 行数，向量化数据传递单位)
- =column/= -- 列类型系统 (~20+ 类型):
  =ColumnVector= / =ColumnString= / =ColumnNullable= /
  =ColumnArray= / =ColumnMap= / =ColumnStruct= /
  =ColumnDecimal= / =ColumnConst=
- =data_type/= -- 类型系统工厂类
- =allocator.h= -- 自定义内存分配器
- =arena.h= -- 内存 Arena

*** load/ -- 数据导入管线

- =delta_writer/= -- Delta Writer (每 Tablet)
- =memtable/= -- 内存写缓冲 → Flush to Segment
- =stream_load/= -- HTTP Stream Load
- =routine_load/= -- Kafka/Pulsar Routine Load
- =group_commit/= -- 小批量 Group Commit

*** io/ -- I/O 抽象层

- =fs/= -- 文件系统抽象: =local/= / =s3/= / =hdfs/= / =azure/=
- =cache/= -- Block 文件缓存 (远程存储加速)

*** exprs/ -- 表达式求值

- =function/= -- 内置标量函数
- =aggregate/= -- 聚合函数
- =table_function/= -- 表生成函数
- =lambda_function/= -- Lambda 表达式

*** format/ -- 文件格式读写

=parquet/= / =orc/= / =csv/= / =json/= / =arrow/= / =lance/= / =native/=

*** cloud/ -- 云原生存储引擎

=cloud_storage_engine= / =cloud_tablet_mgr= / =cloud_rowset_writer= / =cloud_meta_mgr=

*** common/ -- 基础设施

=config.h= / =status.h= / =logging.h= / =signal_handler.h=

*** agent/ -- Agent 服务

=heartbeat_server= / =task_worker_pool= / =topic_subscriber=

*** util/ -- 最大工具库 (~300+ 文件)

网络 / 压缩 / 编码 / 哈希(SIMD) / 数据结构 / 调试 / 时间 / 系统

** BE 查询执行流程

#+BEGIN_SRC plantuml :file be-query-execution.png :exports results
@startuml
skinparam backgroundColor #FEFEFE
skinparam defaultFontSize 11

title BE Pipeline 查询执行流程

(*) --> "PipelineFragmentContext\n(Fragment 实例化)"

--> "Pipeline\n(算子 DAG)"

--> "Source Operator\n(Scan)"
note right
  扫描器类型:
  - olap_scanner
  - file_scanner
  - jdbc_scanner
end note

--> "[storage/tablet]\nTabletReader"

--> "[storage/rowset]\nRowsetReader"

--> "[storage/segment]\nColumnReader"

--> "[io/fs/*]\n读取底层文件"

--> "Intermediate Operators"
note right
  算子类型:
  - Join (Hash/Merge/Nested Loop)
  - Aggregation (Hash/Streaming/Distinct)
  - Sort (全排序/TopN)
  - Exchange (数据 Shuffle)
end note

--> "Sink Operator\n(写入结果)"

--> "[exec/sink]\nvtablet_finder\n(Tablet 路由)"

--> "[load/delta_writer]"

--> "[storage/rowset]\nrowset_writer"

--> "[storage/segment]\ncolumn_writer -> disk"

--> (*)

@enduml
#+END_SRC

#+RESULTS:
#+begin_example
         ,-----.                                                    
         |start|                                                    
         |-----|                                                    
         `-----'                                                    
            |                                                       
            |                                                       
,-----------------------.                                           
|PipelineFragmentContext|                                           
|-----------------------|                                           
|                       |                                           
`-----------------------'                                           
            |                                                       
      ,----------.                                                  
      |Pipeline  |                                                  
      |----------|                                                  
      |          |                                                  
      `----------'                                                  
            |                                                       
            |                                                       
                       ,--------------.                             
    ,---------------.  |扫描器类型:   |                             
    |Source Operator|  |--------------|                             
    |---------------|--|- file_scanner|                             
    |               |  |- jdbc_scanner|                             
    `---------------'  |              |                             
            |          `--------------'                             
            |                                                       
   ,----------------.                                               
   |[storage/tablet]|                                               
   |----------------|                                               
   |                |                                               
   `----------------'                                               
            |                                                       
   ,----------------.                                               
   |[storage/rowset]|                                               
   |----------------|                                               
   |                |                                               
   `----------------'                                               
            |                                                       
            |                                                       
   ,-----------------.                                              
   |[storage/segment]|                                              
   |-----------------|                                              
   |                 |                                              
   `-----------------'                                              
            |                                                       
     ,------------.                                                 
     |[io/fs/*]   |                                                 
     |------------|                                                 
     |            |                                                 
     `------------'                                                 
            |                                                       
            |                                                       
            |              ,---------------------------------------.
                           |算子类型:                              |
,----------------------.   |---------------------------------------|
|Intermediate Operators|   |- Aggregation (Hash/Streaming/Distinct)|
|----------------------|---|- Sort (全排序/TopN)                   |
`----------------------'   |- Exchange (数据 Shuffle)              |
            |              |                                       |
            |              `---------------------------------------'
            |                                                       
     ,-------------.                                                
     |Sink Operator|                                                
     |-------------|                                                
     |             |                                                
     `-------------'                                                
            |                                                       
    ,--------------.                                                
    |[exec/sink]   |                                                
    |--------------|                                                
    |(Tablet 路由) |                                                
    |              |                                                
    `--------------'                                                
            |                                                       
            |                                                       
  ,-------------------.                                             
  |[load/delta_writer]|                                             
  |-------------------|                                             
  `-------------------'                                             
            |                                                       
   ,----------------.                                               
   |[storage/rowset]|                                               
   |----------------|                                               
   |                |                                               
   `----------------'                                               
            |                                                       
                                                                    
 ,---------------------.                                            
 |[storage/segment]    |                                            
 |---------------------|                                            
 |                     |                                            
 `---------------------'                                            
            |                                                       
          ,---.                                                     
          |end|                                                     
          |---|                                                     
          `---'                                                     
#+end_example

* Cloud（云原生）架构

#+BEGIN_SRC text
cloud/
├── CMakeLists.txt              # 产出 doris_cloud 可执行文件
├── src/
│   ├── main.cpp                # 主入口
│   ├── meta-service/           # ★ 核心元数据服务
│   ├── meta-store/             # ★ 元数据存储层 (FoundationDB)
│   ├── resource-manager/       # 资源管理
│   ├── rate-limiter/           # 令牌桶限流
│   ├── recycler/               # GC / 资源回收
│   ├── snapshot/               # 快照模块
│   ├── server/oss/             # 对象存储服务集成
│   └── common/                 # 共享工具 (加密/HTTP/KMS/日志/网络)
├── conf/                       # 配置
│   └── fdb.cluster             # FoundationDB 集群配置
├── script/                     # 生命周期脚本
└── test/                       # 单元测试 (gtest)
#+END_SRC

- *Meta Service* 替代本地 FE 的部分功能，管理全局元数据
- *FoundationDB* 作为分布式元数据存储后端
- BE 的 =cloud/= 目录提供存储引擎的云原生替换（读/写对象存储）

#+BEGIN_SRC plantuml :file cloud-arch.png :exports results
@startuml
skinparam componentStyle rectangle
skinparam backgroundColor #FEFEFE

title 云原生存算分离架构

package "FE (Compute)" #LightBlue {
  [Query Optimizer]
  [Coordinator]
}

package "BE (Compute)" #LightGreen {
  [Pipeline Executor]
}

package "Cloud Meta Service" #LightYellow {
  [meta-service] as MS
  [meta-store] as MST
  database "FoundationDB" as FDB
  MST -down-> FDB
}

package "Object Storage" #LightCoral {
  [S3 / HDFS / Azure] as OS
}

[Query Optimizer] -down-> [Coordinator]
[Coordinator] -down-> [Pipeline Executor]
[Pipeline Executor] -right-> MS : 元数据
[Pipeline Executor] -down-> OS : 读写数据
MS -down-> FDB
@enduml
#+END_SRC

#+RESULTS:
#+begin_example
 ,---------------.                                
 |Query Optimizer|                                
 |---------------|                                
 `---------------'                                
         |                                        
         |                                        
   ,-----------.                                  
   |Coordinator|                                  
   |-----------|                                  
   `-----------'                                  
         |                                        
,-----------------.  ,------------.   ,----------.
|Pipeline Executor|  |meta-service|   |meta-store|
|-----------------|--|------------|   |----------|
`-----------------'  `------------'   `----------'
         |                                        
                                                  
,-----------------.          ,------------.       
|S3 / HDFS / Azure|          |FoundationDB|       
|-----------------|          |------------|       
`-----------------'          `------------'       
#+end_example

* 通信与序列化

** IDL 定义目录 (=gensrc/=)

- =proto/= -- Protocol Buffers 定义
  - =olap_file.proto= -- 存储引擎数据格式
  - =segment_v2.proto= -- Segment V2 格式
  - =data.proto= -- 查询数据传输
  - =internal_service.proto= -- BE 间 RPC (BRPC)
  - =function_service.proto= -- 远程 UDF 调用
  - =cloud.proto= -- Cloud 服务消息
  - =types.proto= -- 类型系统

- =thrift/= -- Apache Thrift IDL
  - =FrontendService.thrift= -- FE↔BE 主要 RPC 接口
  - =BackendService.thrift= -- BE 服务接口
  - =HeartbeatService.thrift= -- 心跳服务
  - =Planner.thrift= -- 查询计划
  - =PlanNodes.thrift= -- 计划节点定义
  - =Descriptors.thrift= -- 描述符
  - =Types.thrift= / =Exprs.thrift= -- 类型和表达式
  - =Data.thrift= / =DataSinks.thrift= -- 数据传输

** 通信协议全景

#+BEGIN_SRC plantuml :file protocol-arch.png :exports results
@startuml
skinparam componentStyle rectangle
skinparam backgroundColor #FEFEFE
skinparam defaultFontSize 11

title Doris 通信协议全景

node "FE (Leader)" as FEL #LightBlue
node "FE (Follower)" as FEF #LightBlue
node "BE" as BE #LightGreen
node "BE (其他节点)" as BEPeer #LightGreen
actor "Client\n(MySQL/JDBC)" as Client
actor "Stream Load" as SL
actor "Arrow Flight" as AF

FEL <--> BEPeer : Thrift\n(HeartbeatService)
FEL <--> BE : Thrift\n(FrontendService)
Client --> FEL : MySQL Protocol
Client --> BE : HTTP (Stream Load)
Client --> BE : Arrow Flight SQL
BE <--> BEPeer : BRPC\n(PInternalService)
@enduml
#+END_SRC

#+RESULTS:
#+begin_example
,------------.                                             
|Client      |              ,-------------.   ,-----------.
|------------|              |FE (Follower)|   |Stream Load|
|            |              |-------------|   |-----------|
`------------'              `-------------'   `-----------'
                                                           
                                                           
            ,-----------.   ,------------.                 
            |FE (Leader)|   |Arrow Flight|                 
            |-----------|   |------------|                 
            `-----------'   `------------'                 
                                                           
        ,--.                                               
        |BE|                                               
        |--|                                               
        `--'                                               
                                                           
                                                           
     ,-------------.                                       
     |BE (其他节点)|                                       
     |-------------|                                       
     `-------------'                                       
#+end_example

* 构建系统

** 构建流程

#+BEGIN_SRC plantuml :file build-flow.png :exports results
@startuml
skinparam backgroundColor #FEFEFE
skinparam defaultFontSize 11

title Doris 构建流程

(*) --> "build.sh" as Build

Build --> "env.sh" as Env
note right
  - Darwin: Homebrew -> custom_env_mac.sh
  - Linux: 系统包管理
  - 工具链: Clang (默认) 或 GCC
  - ccache 编译缓存加速
end note

Build --> "gensrc/" as Gen
note right
  Proto -> C++/Java
  Thrift -> Java/C++
end note

Build --> "thirdparty/" as TP

TP --> "build-thirdparty.sh\n(从源码编译)" as BuildTP
TP --> "download-prebuild-thirdparty.sh\n(下载预编译包)" as DLTP

Build --> "FE 编译 (Maven)" as FEMvn
note right
  mvn clean package
  -DskipTests -pl fe-core
end note

Build --> "BE 编译 (CMake + Ninja)" as BECMake
note right
  cmake -G Ninja
  -DCMAKE_BUILD_TYPE=Release
  ninja -j$(nproc)
end note

--> (*)

@enduml
#+END_SRC

#+RESULTS:
#+begin_example
                                                                                            ,-----.                                                                                                             
                                                                                            |start|                                                                                                             
                                                                                            |-----|                                                                                                             
                                                                                            `-----'                                                                                                             
                                                                                                |                                                                                                               
                                                                                                |                                                                                                               
                                                                                           ,--------.                                                                                                           
                                                                                           |build.sh|                                                                                                           
                                                                                           |--------|                                                                                                           
                                                                                           `--------'                                                                                                           
                                                                                                |                                                                                                               
          ,---------------------------------------.                                             |                                                                                                               
          |- Darwin: Homebrew -> custom_env_mac.sh|               ,------------------.          |                            ,-----------------------.                              ,--------------------------.
,------.  |---------------------------------------|   ,-------.   |Proto -> C++/Java |   ,-----------.   ,---------------.   |mvn clean package      |  ,-----------------------.   |cmake -G Ninja            |
|env.sh|  |- 工具链: Clang (默认) 或 GCC          |   |gensrc/|   |------------------|   |thirdparty/|   |FE 编译 (Maven)|   |-----------------------|  |BE 编译 (CMake + Ninja)|   |--------------------------|
|------|--|- ccache 编译缓存加速                  |   |-------|---|                  |   |-----------|   |---------------|---|                       |  |-----------------------|---|ninja -j$(nproc)          |
`------'  |                                       |   `-------'   `------------------'   `-----------'   `---------------'   `-----------------------'  `-----------------------'   |                          |
          `---------------------------------------'                                                                                                                  |              `--------------------------'
                                                                                                                                                                     |                                          
                                                                                                                                                                     |                                          
                                                                      ,-------------------.   ,-------------------------------.                                   ,---.                                         
                                                                      |build-thirdparty.sh|   |download-prebuild-thirdparty.sh|                                   |end|                                         
                                                                      |-------------------|   |-------------------------------|                                   |---|                                         
                                                                      |                   |   |                               |                                   `---'                                         
                                                                      `-------------------'   `-------------------------------'                                                                                 
#+end_example

** 关键技术栈

#+ATTR_HTML: :border 2 :rules all :frame border
| 组件  | 语言        | 编译器/运行时        | 构建工具           | 版本要求 |
|-------+-------------+---------------------+-------------------+---------|
| FE    | Java        | JDK 17              | Maven             | -       |
| BE    | C++20       | Clang 16+ / GCC 11+ | CMake 3.22.1+Ninja | C++20   |
| Cloud | C++20       | Clang 16+ / GCC 11+ | CMake 3.22.1      | C++20   |
| UI    | TypeScript  | Node.js             | Webpack           | -       |
| 测试  | Groovy/Java | JDK 17              | Maven             | -       |

** 第三方依赖 (核心)

#+ATTR_HTML: :border 2 :rules all :frame border
| 库                   | 版本   | 用途                          |
|----------------------+--------+------------------------------|
| Apache Thrift        | 0.16.0 | RPC 框架                      |
| Protobuf             | 21.11  | 序列化                        |
| bRPC                 | 1.4.0  | 高性能 RPC (BE 间通信)        |
| Apache Arrow         | 17.0.0 | 列式内存格式                  |
| RocksDB              | 5.14.2 | 嵌入式 KV 存储                |
| jemalloc             | 5.3.0  | 内存分配器                    |
| Boost                | 1.81.0 | C++ 工具库                    |
| gRPC                 | 1.54.3 | gRPC 通信                     |
| Apache ORC           | 1.9.0  | ORC 文件格式                  |
| hyperscan/vectorscan | 5.4.x  | 正则匹配 (x86/ARM)            |
| librdkafka           | 2.11.0 | Kafka 客户端                  |
| FoundationDB         | -      | Cloud 元数据存储后端          |

* 数据存储层次

#+BEGIN_SRC plantuml :file storage-hierarchy.png :exports results
@startuml
skinparam backgroundColor #FEFEFE
skinparam defaultFontSize 12

title Doris 数据存储层次

rectangle "Database (数据库)" as DB #LightBlue
rectangle "Table (表)" as Table #LightGreen
rectangle "Partition (分区)" as Partition #LightYellow

DB --> Table
Table --> Partition

rectangle "Tablet (数据分片)" as Tablet #LightCoral
note right of Tablet
  最小物理存储和调度单元
end note
Partition --> Tablet

rectangle "TabletMeta\n(版本列表/行数/数据大小)" as Meta #Wheat
Tablet --> Meta

rectangle "Rowset (数据版本)" as Rowset #Plum
note right of Rowset
  MVCC 版本管理
end note
Tablet --> Rowset

rectangle "Segment (数据文件)" as Seg #Orange
note right of Seg
  Parquet-like 列存格式
end note
Rowset --> Seg

rectangle "Column Data Pages" as ColPages
rectangle "Bloom Filter Index" as BF
rectangle "Zone Map Index" as Zone
rectangle "Inverted Index" as Inv

Seg --> ColPages
Seg --> BF
Seg --> Zone
Seg --> Inv

rectangle "Rowset\n(下一个版本)" as Rowset2 #Plum
rectangle "Segment" as Seg2 #Orange
Rowset --> Rowset2
Rowset2 --> Seg2
@enduml
#+END_SRC

#+RESULTS:
#+begin_example
                                               ,-----------------.                                 
                                               |Database (数据库)|                                 
                                               |-----------------|                                 
                                               `-----------------'                                 
                                                         |                                         
                                                         |                                         
                                                   ,----------.                                    
                                                   |Table (表)|                                    
                                                   |----------|                                    
                                                   `----------'                                    
                                                         |                                         
                                                ,----------------.                                 
                                                |Partition (分区)|                                 
                                                |----------------|                                 
                                                `----------------'                                 
                                                         |                                         
                                                                                                   
                                               ,-----------------.   ,----------------------.      
                                               |Tablet (数据分片)|   |最小物理存储和调度单元|      
                                               |-----------------|---|----------------------|      
                                               `-----------------'   `----------------------'      
                                                                                                   
                               ,------------------------.   ,-----------------.   ,-------------.  
                               |TabletMeta              |   |Rowset (数据版本)|   |MVCC 版本管理|  
                               |------------------------|   |-----------------|---|-------------|  
                               |                        |   `-----------------'   `-------------'  
                               `------------------------'                                          
                                                                                                   
                                                                                     ,------------.
                                    ,------------------.   ,---------------------.   |Rowset      |
                                    |Segment (数据文件)|   |Parquet-like 列存格式|   |------------|
                                    |------------------|---|---------------------|   |            |
                                    `------------------'   `---------------------'   `------------'
                                                                                            |      
                                                                                            |      
,-----------------.  ,------------------.   ,--------------.   ,--------------.         ,-------.  
|Column Data Pages|  |Bloom Filter Index|   |Zone Map Index|   |Inverted Index|         |Segment|  
|-----------------|  |------------------|   |--------------|   |--------------|         |-------|  
`-----------------'  `------------------'   `--------------'   `--------------'         `-------'  
#+end_example

关键概念:
- *Tablet* 是最小的物理存储和调度单元
- *Rowset* 代表一个数据版本 (MVCC)
- *Segment* 是实际数据文件，列式存储
- *Compaction* 合并多个 Rowset 为一个，减少碎片

* 关键设计模式

** FE 元数据管理 (HA)

#+BEGIN_SRC plantuml :file fe-metadata-ha.png :exports results
@startuml
skinparam backgroundColor #FEFEFE
skinparam defaultFontSize 11

title FE 元数据管理与高可用

participant "Client DDL" as Client
participant "catalog/Env\n(内存)" as Env
database "journal/bdbje\n(BerkeleyDB JE)" as BDB
database "image/\n(Checkpoint 快照)" as Image
participant "Follower FE" as Follower

Client -> Env : DDL 操作
Env -> Env : 更新内存元数据\n(Database→Table→Partition→Tablet→Replica)
Env -> BDB : 写入 Journal
BDB -> Follower : BDB HA 复制
Follower -> Follower : 重放 Journal\n同步内存状态
Env -> Image : 定时 Checkpoint

@enduml
#+END_SRC

#+RESULTS:
#+begin_example
                                                                    FE 元数据管理与高可用                                                                   
                                                                                                                                                            
                                                                                ,.-^^-._                    ,.-^^-._                                        
                                                                               |-.____.-|                  |-.____.-|                                       
                                                                               |        |                  |        |                                       
                                                                               |        |                  |        |                                       
                            ,-----------.                                      |        |                  |        |                                       
     ,----------.           |catalog/Env|                                      '-.____.-'                  '-.____.-'              ,-----------.            
     |Client DDL|           |(内存)     |                                   journal/bdbje              image/                      |Follower FE|            
     `-----+----'           `-----+-----'                                   (BerkeleyDB JE)            (Checkpoint 快照)           `-----+-----'            
           |      DDL 操作        |                                                |                           |                         |                  
           |--------------------->|                                                |                           |                         |                  
           |                      |                                                |                           |                         |                  
           |                      |----.                                           |                           |                         |                  
           |                      |    | 更新内存元数据                            |                           |                         |                  
           |                      |<---' (Database→Table→Partition→Tablet→Replica) |                           |                         |                  
           |                      |                                                |                           |                         |                  
           |                      |                                                |                           |                         |                  
           |                      |                 写入 Journal                   |                           |                         |                  
           |                      |----------------------------------------------->|                           |                         |                  
           |                      |                                                |                           |                         |                  
           |                      |                                                |                    BDB HA 复制                      |                  
           |                      |                                                |---------------------------------------------------->|                  
           |                      |                                                |                           |                         |                  
           |                      |                                                |                           |                         |----.             
           |                      |                                                |                           |                         |    | 重放 Journal
           |                      |                                                |                           |                         |<---' 同步内存状态
           |                      |                                                |                           |                         |                  
           |                      |                                                |                           |                         |                  
           |                      |                              定时 Checkpoint   |                           |                         |                  
           |                      |--------------------------------------------------------------------------->|                         |                  
     ,-----+----.           ,-----+-----.                                   journal/bdbje              image/                      ,-----+-----.            
     |Client DDL|           |catalog/Env|                                   (Be ,.-^^-._JE)            (Che ,.-^^-._照)           |Follower FE|            
     `----------'           |(内存)     |                                      |-.____.-|                  |-.____.-|              `-----------'            
                            `-----------'                                      |        |                  |        |                                       
                                                                               |        |                  |        |                                       
                                                                               |        |                  |        |                                       
                                                                               '-.____.-'                  '-.____.-'                                       
                                                                                                                                                            
#+end_example

** BE Pipeline 执行模型

#+BEGIN_SRC plantuml :file pipeline-execution.png :exports results
@startuml
skinparam backgroundColor #FEFEFE
skinparam defaultFontSize 11

title BE Pipeline 执行模型

(*) --> "查询计划 → Fragment DAG"

--> "Pipeline 拆分\n(根据数据 Shuffle 边界)"

--> "PipelineTask\n(最细粒度调度单元)"

note right
  • 多级反馈队列 (TaskQueue)
  • CPU 时间片轮转
  • 算子溢写磁盘 (Spill)
  • Runtime Filter 传播
end note

--> (*)

@enduml
#+END_SRC

#+RESULTS:
#+begin_example
         ,-----.                                     
         |start|                                     
         |-----|                                     
         `-----'                                     
            |                                        
            |                                        
,-----------------------.                            
|查询计划 → Fragment DAG|                            
|-----------------------|                            
`-----------------------'                            
            |                                        
,-----------------------.                            
|Pipeline 拆分          |                            
|-----------------------|                            
|                       |                            
`-----------------------'                            
            |                                        
            |                                        
                         ,--------------------------.
  ,------------------.   |• 多级反馈队列 (TaskQueue)|
  |PipelineTask      |   |--------------------------|
  |------------------|---|• 算子溢写磁盘 (Spill)    |
  |                  |   |• Runtime Filter 传播     |
  `------------------'   |                          |
            |            `--------------------------'
            |                                        
          ,---.                                      
          |end|                                      
          |---|                                      
          `---'                                      
#+end_example

** Nereids 优化器 (Cascades 框架)

#+BEGIN_SRC plantuml :file nereids-cascades.png :exports results
@startuml
skinparam backgroundColor #FEFEFE
skinparam defaultFontSize 11

title Nereids 优化器 (Cascades 框架)

(*) --> "SQL Parse Tree"

--> "Analyzer\n(语义分析)"
note right: 绑定/类型推导

--> "Logical Plan\n(初始逻辑计划)"

--> "Rewrite Rules\n(基于规则的优化)"
note right: 谓词下推/常量折叠/...

--> "Exploration Rules\n(探索等价计划空间)"
note right: Join 重排/...

--> "Implementation Rules\n(逻辑→物理转换)"

--> "Cost-based Enumeration\n(Memo + 代价模型选择最优)"

--> "Physical Plan"

--> "Translator\n→ BE PlanFragment"

--> (*)

@enduml
#+END_SRC

#+RESULTS:
#+begin_example
          ,-----.                               
          |start|                               
          |-----|                               
          `-----'                               
             |                                  
             |                                  
     ,--------------.                           
     |SQL Parse Tree|                           
     |--------------|                           
     `--------------'                           
             |                                  
       ,----------.                             
       |Analyzer  |   ,-------------.           
       |----------|   |绑定/类型推导|           
       |          |---|-------------|           
       `----------'   `-------------'           
             |                                  
                                                
     ,--------------.                           
     |Logical Plan  |                           
     |--------------|                           
     |              |                           
     `--------------'                           
             |                                  
    ,----------------.   ,---------------------.
    |Rewrite Rules   |   |谓词下推/常量折叠/...|
    |----------------|---|---------------------|
    |                |   `---------------------'
    `----------------'                          
             |                                  
   ,------------------.                         
   |Exploration Rules |   ,-------------.       
   |------------------|   |Join 重排/...|       
   |                  |---|-------------|       
   `------------------'   `-------------'       
             |                                  
             |                                  
  ,--------------------.                        
  |Implementation Rules|                        
  |--------------------|                        
  |                    |                        
  `--------------------'                        
             |                                  
,-------------------------.                     
|Cost-based Enumeration   |                     
|-------------------------|                     
|                         |                     
`-------------------------'                     
             |                                  
                                                
      ,-------------.                           
      |Physical Plan|                           
      |-------------|                           
      `-------------'                           
             |                                  
    ,-----------------.                         
    |Translator       |                         
    |-----------------|                         
    |                 |                         
    `-----------------'                         
             |                                  
           ,---.                                
           |end|                                
           |---|                                
           `---'                                
#+end_example

* macOS M4 (Apple Silicon) 编译注意事项

- CMake 必须使用 *3.22.1* 特定版本
- ARM64 上 =hyperscan= 替换为 =vectorscan=
- 使用 =-Wl,-dead_strip= 减小二进制大小
- Debug 模式使用 =-Og= 而非 =-O0=（避免 tcmalloc ARM64 分支偏移溢出）
- =cp -r -p= 解决 ARM64 上复制大文件的 "Killed: 9" 问题
- 默认使用 Clang + libc++
- Azure SDK 在 ARM/Darwin 上默认禁用

* 文档信息

- 生成时间: 2026-06-23
- 基于分支: master (commit: 328ad6ace17)
- 原始 Markdown 版本: =architecture.md=
